app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "dfffff"], ["content", "dffffff"], ["created_at", "2024-10-21 15:40:11.233901"], ["updated_at", "2024-10-21 15:40:11.233901"], ["user_id", 1]]
---
  def create
    @post = Post.new(get_params) # to-do add user_id
    @post.user_id = current_user.id

    if @post.save